Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `BCFIPS` provider option is supported in native image but the algorithm self-tests which rely on `java.security.SecureRandom` to verify the generated keys have been removed for these tests to pass. The following classes have been affected: - `org.bouncycastle.crypto.general.DSA` - `org.bouncycastle.crypto.general.DSTU4145` - `org.bouncycastle.crypto.general.ECGOST3410` - `org.bouncycastle.crypto.general.GOST3410` - `org.bouncycastle.crypto.fips.FipsDSA` - `org.bouncycastle.crypto.fips.FipsEC` - `org.bouncycastle.crypto.fips.FipsRSA`
ja_jp: `BCFIPS` プロバイダー・オプションはネイティブ・イメージでサポートされていますが、生成されたキーを検証するために に依存していたアルゴリズムのセルフテストは、これらのテストに合格するために削除されました。以下のクラスが影響を受けています: - `org.bouncycastle.crypto.general.DSA` - `org.bouncycastle.crypto.general.DSTU4145` - `org.bouncycastle.crypto.general.ECGOST3410` - `org.bouncycastle.crypto.general.GOST3410` - `org.bouncycastle.crypto.fips.FipsDSA` - `org.bouncycastle.crypto.fips.FipsEC` - `org.bouncycastle.crypto.fips.FipsRSA`

source: `BUILD_AND_RUN_TIME_FIXED` and `RUN_TIME` config roots can be injected in any bean. `RUN_TIME` config roots should only be injected after the bootstrap though.
ja_jp: `BUILD_AND_RUN_TIME_FIXED` と `RUN_TIME` 設定ルートは、どのBeanにも注入することができます。 `RUN_TIME` 設定ルールは、ブートストラップの後にのみ注入すべきです。

source: `Base price` (Decision element, of type `number`)
ja_jp: `Base price` (Decision要素 、 `number` 型)

source: `Basic*`: all classes starting with `Basic`
ja_jp: `Basic*` : `Basic` で始まるすべてのクラス。

source: `BeanContainerBuildItem`: describes a container used to store and retrieve object instances during the deployment.
ja_jp: `BeanContainerBuildItem`: デプロイ時にオブジェクトインスタンスを保存・取得するために使用するコンテナーについて説明します。

source: `BeanDefiningAnnotationBuildItem` Example
ja_jp: `BeanDefiningAnnotationBuildItem` の例

source: `BeanDiscoveryFinishedBuildItem` Example
ja_jp: `BeanDiscoveryFinishedBuildItem` の例

source: `BeanManager` - only the following methods are implemented: `getBeans()`, `createCreationalContext()`, `getReference()`, `getInjectableReference()` , `resolve()`, `getContext()`, `fireEvent()`, `getEvent()` and `createInstance()`
ja_jp: `BeanManager` - メソッドでは、 `getBeans()`、 `createCreationalContext()`、 `getReference()`、 `getInjectableReference()`、 `resolve()`、 `getContext()`、 `fireEvent()`、 `getEvent()`、および `createInstance()` のみが実装されています。

source: `BeanParam` is required to comply with the Jakarta REST specification so that libraries like OpenAPI can introspect the parameters.
ja_jp: `BeanParam` は、OpenAPIのようなライブラリがパラメータを確認できるように、Jakarta REST仕様に準拠する必要があります。

source: `Bearer Token` mechanism extracts the token from HTTP `Authorization` header. `Authorization Code Flow` mechanism uses OpenID Connect Authorization Code flow. It redirects the user to IDP to authenticate and completes the authentication process after the user has been redirected back to Quarkus by exchanging the provided code grant for ID, access and refresh tokens.
ja_jp: `Bearer Token` メカニズムは、HTTP `Authorization` ヘッダーからトークンを抽出します。 `Authorization Code Flow` メカニズムは、OpenId Connect Authorization Code Flow を使用します。これは、ユーザーを IDP にリダイレクトして認証を行い、提供されたコードグラントを ID、アクセストークン、リフレッシュトークンと交換することで、ユーザーが Quarkus にリダイレクトされた後に認証プロセスを完了させます。

source: `BuildItem` instances should be immutable, as the producer/consumer model does not allow for mutation to be correctly ordered. This is not enforced but failure to adhere to this rule can result in race conditions.
ja_jp: `BuildItem` インスタンスはイミュータブルでなければなりません。プロデューサー/コンシューマーモデルでは、ミューテーションを正しく順序付けることができないからです。これは強制されるものではありませんが、このルールに従わないと競合状態になる可能性があります。

source: `BuildTimeActionBuildItem` is automatically scoped with your extension namespace
ja_jp: `BuildTimeActionBuildItem` は、エクステンションの namespace で自動的にスコープ指定されます。

source: `CacheKeyGenerator` for cache extension
ja_jp: キャッシュエクステンション用 `CacheKeyGenerator`

source: `Capabilities.isCapabilityWithPrefixPresent(prefix)` could be used to check whether a capability with a given prefix is present.
ja_jp: `Capabilities.isCapabilityWithPrefixPresent(prefix)` は、与えられた接頭辞を持つケイパビリティが存在するかどうかをチェックするために使用できます。

source: `CloudEventsFunction` is a feature of Cloud Function gen 2 only.
ja_jp: `CloudEventsFunction` は、第2世代のCloud Functionのみの機能です。

source: `CloudEventsFunction` is a feature of Cloud Functions gen 2 only.
ja_jp: `CloudEventsFunction` は、第２世代のCloud Functionsのみの機能です。

source: `Collection<BeanInfo>` containing all beans
ja_jp: すべての Bean を含む `Collection<BeanInfo>`

source: `Collection<BeanInfo>` containing all the removed beans; see <<cdi-reference.adoc#remove_unused_beans,Removing unused beans>> for more information
ja_jp: `Collection<BeanInfo>` 削除されたすべての link:cdi-reference.html#remove_unused_beans[Bean] を含む

source: `Collection<InjectionPointInfo>` containing all injection points
ja_jp: すべてのインジェクションポイントを含む `Collection<InjectionPointInfo>`

source: `Collection<ObserverInfo>` containing all observers
ja_jp: すべてのオブザーバーを含む `Collection<ObserverInfo>`

source: `Collection<ScopeInfo>` containing all scopes, including custom ones
ja_jp: カスタムスコープも含め、すべてのスコープを含む `Collection<ScopeInfo>`

source: `CompletionStage` (from the JDK)
ja_jp: `CompletionStage` （JDKから）

source: `ConfiguredBean` will be processed by the CDI layer the same as a bean annotated with the CDI standard @ApplicationScoped.
ja_jp: `ConfiguredBean` は、CDI 標準 @ApplicationScoped でアノテーションが付けられた Bean と同じように CDI レイヤーによって処理されます。

source: `ConsumerRecord` is provided by the underlying Kafka client and can be injected directly to the consumer method. Another simpler approach consists in using `Record`:
ja_jp: `ConsumerRecord` は、基盤となる Kafka クライアントによって提供され、コンシューマーメソッドに直接注入することができます。 `Record` の使用に際して、以下のような別の簡単なアプローチがあります。

source: `ContextRegistrationPhaseBuildItem` Example
ja_jp: `ContextRegistrationPhaseBuildItem` の例

source: `CoolService#isCool()` returns `Boolean` that is associated with the current connection.
ja_jp: `CoolService#isCool()` は、現在の接続に関連付けられている `Boolean` を返します。

source: `CustomResource` would be activated on a `@QuarkusIntegrationTest` using `@QuarkusTestResource` as is described in the corresponding section of this doc.
ja_jp: このドキュメントの対応するセクションで説明されているように、 `CustomResource` は `@QuarkusTestResource` を使用して `@QuarkusIntegrationTest` でアクティブ化されます。

source: `CustomScopeBuildItem` Example
ja_jp: `CustomScopeBuildItem` の例

source: `DELETE /fruits/:id` - deletes an entity by ID.
ja_jp: `DELETE /fruits/:id` - ID に基づいてエンティティを削除します。

source: `Deployment` is a Kubernetes resource and not OpenShift specific, so it cannot leverage `ImageStream` resources, as is the case with `DeploymentConfig`. Therefore, the image references must include the container image registry that hosts the image.
ja_jp: `Deployment` は Kubernetes リソースであり、OpenShift 固有のものではないため、 `DeploymentConfig`のように `ImageStream` リソースを活用することはできません。 したがって、イメージの参照には、イメージをホストするコンテナ・イメージ・レジストリを含める必要があります。

source: `Dev Services For Keycloak` will not be activated if either `quarkus.oidc.auth-server-url` is already initialized or the default OIDC tenant is disabled with `quarkus.oidc.tenant.enabled=false`, irrespectively of whether you work with Keycloak or not.
ja_jp: `quarkus.oidc.auth-server-url` がすでに初期化されているか、デフォルトの OIDC テナントが `quarkus.oidc.tenant.enabled=false` で無効になっている場合、Keycloak を使用するかどうかにかかわらず、 `Dev Services ForKeycloak` はアクティブ化されません。

source: `Dev Services for Keycloak` will initialize a launched Keycloak server next.
ja_jp: `Dev Services for Keycloak` は、起動された Keycloak サーバーを次に初期化します。

source: `Dev Services` log output from started services like databases, Kafka brokers, etc.
ja_jp: データベース、Kafka ブローカーなどの起動されたサービスからの `Dev Services` ログ出力

source: `Double Submit Cookie` technique requires that the CSRF token sent as `HTTPOnly`, optionally signed, cookie to the client, and directly embedded in a hidden form input of server-side rendered HTML forms, or submitted as a request header value.
ja_jp: `Double Submit Cookie` テクニックを使うには、CSRF トークンを (オプションで署名された) `HTTPOnly` クッキーとしてクライアントに送り、サーバサイドでレンダリングされた HTML フォームの隠されたフォーム入力に直接埋め込むか、リクエストヘッダ値として送信する必要があります。

source: `ECDH-ES` is the default EC public key encryption algorithm.
ja_jp: `ECDH-ES` はデフォルトの EC 公開鍵暗号化アルゴリズムです。

source: `ES256` is the default EC private key signature algorithm.
ja_jp: `ES256` はデフォルトの EC 秘密鍵署名アルゴリズムです。

source: `EngineBuilder` Observer Example
ja_jp: `EngineBuilder` オブザーバーの例

source: `ExceptionUnwrapStrategy.ALWAYS`: Always unwraps exception before checking mappers. Only falls back to checking mappers for the wrapper exception if no mapper is found for any unwrapped cause.
ja_jp: `ExceptionUnwrapStrategy.ALWAYS`: マッパーをチェックする前に常に例外をアンラップします。アンラップされた原因に対してマッパーが見つからない場合にのみ、ラッパー例外のマッパーをチェックするフォールバックを行います。

source: `ExceptionUnwrapStrategy.UNWRAP_IF_NO_EXACT_MATCH`: Unwraps if the thrown exception type itself has no exact mapper registered. Checks for an exact match first, then unwraps if none is found.
ja_jp: `ExceptionUnwrapStrategy.UNWRAP_IF_NO_EXACT_MATCH`: スローされた例外型自体に正確なマッパーが登録されていない場合にアンラップします。最初に正確な一致をチェックし、見つからない場合はアンラップします。

source: `ExceptionUnwrapStrategy.UNWRAP_IF_NO_MATCH` (default): Unwraps only if neither the thrown exception nor any of its supertypes have a registered mapper. Checks the entire type hierarchy before unwrapping.
ja_jp: `ExceptionUnwrapStrategy.UNWRAP_IF_NO_MATCH` (デフォルト): スローされた例外またはそのスーパークラスのいずれにも登録されたマッパーがない場合にのみアンラップします。アンラップする前に、型階層全体をチェックします。

source: `FAIL_ON_UNKNOWN_PROPERTIES` is now disabled by default for the default CDI-enabled `ObjectMapper`.
ja_jp: デフォルトで CDI で有効になっている `ObjectMapper` で `FAIL_ON_UNKNOWN_PROPERTIES` が無効になりました。

source: `FOO_BAR_BAZ` - Replace each character that is neither alphanumeric nor `\_` with `_`; then convert the name to upper case
ja_jp: `FOO_BAR_BAZ` - 英数字でも `_` でもない各文字を `_` で置換。その後、名前を大文字に変換

source: `FeatureBuildItem` represents a functionality provided by an extension. The name of the feature gets displayed in the log during application bootstrap. An extension should provide at most one feature.
ja_jp: `FeatureBuildItem` はエクステンションによって提供される機能を表します。機能の名前は、アプリケーションの起動時にログに表示されます。エクステンションは最大でも 1 つの機能を提供しなければなりません。

source: `FileItem` attribute is created for the request attribute that represented a file attribute saved on the file system
ja_jp: `FileItem` 属性は、ファイルシステムに保存されたファイル属性を表すリクエスト属性に対して作成されます。

source: `FileItem` attribute is created for the request attribute that represented an in memory file attribute
ja_jp: メモリー内のファイル属性を表すリクエスト属性に対して `FileItem` 属性が作成されます。

source: `Foo` component
ja_jp: `Foo` コンポーネント

source: `Foo` depends on `Charlie` which declares a method `ping()`.
ja_jp: `Foo` は、メソッド `ping()` を宣言する `Charlie` に依存します。

source: `Foo` depends on the config property `bar`. `@Inject` is not needed for this injection point because it also declares a CDI qualifier - this is a Quarkus-specific feature.
ja_jp: `Foo` は設定プロパティー `bar` に依存します。 `@Inject` は CDI 修飾子も宣言するため、このインジェクションポイントには必要ありません。これは Quarkus 固有の機能です。

source: `Foo` is an `@ApplicationScoped` CDI bean.
ja_jp: `Foo` は `@ApplicationScoped` CDI Bean です。

source: `FrontendResource` has 4 endpoints:
ja_jp: `FrontendResource` には 4 つのエンドポイントがあります。

source: `FrontendResource` has eight endpoints:
ja_jp: `FrontendResource` には 8 つのエンドポイントがあります。

source: `FrontendResource` uses the injected `RestClientWithOidcClientFilter` REST client with the OIDC client filter to get and propagate an access token to `ProtectedResource` when either `/frontend/user-name-with-oidc-client-token` or `/frontend/admin-name-with-oidc-client-token` is called.
ja_jp: `FrontendResource` は、 `/frontend/user-name-with-oidc-client-token` または `/frontend/admin-name-with-oidc-client-token` のいずれかが呼び出されたときに、注入された `RestClientWithOidcClientFilter` REST クライアントと OIDC クライアントフィルターを使用し、アクセストークンを取得して `ProtectedResource` に伝播します。

source: `FrontendResource` uses the injected `RestClientWithTokenPropagationFilter` REST client with the OIDC token propagation filter to propagate the current incoming access token to `ProtectedResource` when either `/frontend/user-name-with-propagated-token` or `/frontend/admin-name-with-propagated-token` is called.
ja_jp: `FrontendResource` は、 `/frontend/user-name-with-propagated-token` または `/frontend/admin-name-with-propagated-token` のいずれかが呼び出されたときに、注入された `RestClientWithTokenPropagationFilter` REST クライアントと OIDC トークン伝播フィルターを使用して、現在の受信アクセストークンを `ProtectedResource` に伝播します。

source: `FrontendResource` uses the programmatically created OIDC client to get and propagate an access token to `ProtectedResource` by passing it directly to the injected `RestClientWithTokenHeaderParam` REST client's method as an HTTP `Authorization` header value, when either `/frontend/user-name-with-oidc-client-token-header-param` or `/frontend/admin-name-with-oidc-client-token-header-param` is called.
ja_jp: `FrontendResource` は、 `/frontend/user-name-with-oidc-client-token-header-param` または `/frontend/admin-name-with-oidc-client-token-header-param` のいずれかが呼び出されたときに、プログラムで作成された OIDC クライアントを使用してアクセストークンを取得し、注入された `RestClientWithTokenHeaderParam` REST クライアントのメソッドに HTTP `Authorization` ヘッダー値として直接アクセストークンを渡すことで `ProtectedResource` に伝播します。

source: `FrontendResource` will use REST Client with `OpenID Connect Client Reactive Filter` to acquire and propagate an access token to `ProtectedResource` when either `/frontend/user-name-with-oidc-client-token` or `/frontend/admin-name-with-oidc-client-token` is called. And it will use REST Client with `OpenID Connect Token Propagation Reactive Filter` to propagate the current incoming access token to `ProtectedResource` when either `/frontend/user-name-with-propagated-token` or `/frontend/admin-name-with-propagated-token` is called.
ja_jp: `FrontendResource` は、 `/frontend/user-name-with-oidc-client` または `/frontend/admin-name-with-oidc-client` が呼び出された場合、REST Client と `OpenID Connect Client Reactive Filter` を使用して、 `ProtectedResource` へのアクセストークンを取得および伝播します。また、 `/frontend/user-name-with-propagated-token` もしくは `/frontend/admin-name-with-propagated-token` が呼び出されると、REST Client と `OpenID Connect Token Propagation Reactive Filter` を使用して、 `ProtectedResource` への現在の受信アクセストークンを伝播します。

source: `FruitResource` now provides a few REST endpoints that can be used to perform CRUD operation on `Fruit`.
ja_jp: `FruitResource` は、 `Fruit` で CRUD 操作を実行するために使用できるいくつかの REST エンドポイントを提供するようになりました。

source: `GET /.well-known/webauthn`: Retreives the list of https://passkeys.dev/docs/advanced/related-origins/[related origins].
ja_jp: `GET /.well-known/webauthn`: https://passkeys.dev/docs/advanced/related-origins/[related origins] のリストを取得する

source: `GET /fruits/:id` - returns an entity by ID.
ja_jp: `GET /fruits/:id` - IDに基づいてエンティティを返却します。

source: `GET /fruits` - lists all entities or returns a page if `PagingAndSortingRepository` or `JpaRepository` is used.
ja_jp: `GET /fruits` - すべてのエンティティのリストを返却するか、 `PagingAndSortingRepository` または `JpaRepository` が使用されている場合はページを返します。

source: `GET /q/webauthn/login-options-challenge?username=<username>`: Set up and obtain a login challenge
ja_jp: `GET /q/webauthn/login-options-challenge?username=<username>`: ログインチャレンジをセットアップして取得する

source: `GET /q/webauthn/logout`: Logs you out
ja_jp: `GET /q/webauthn/logout` :ログアウトします。

source: `GET /q/webauthn/register-options-challenge?username=<username>&displayName=<displayName>`: Set up and obtain a registration challenge
ja_jp: `GET /q/webauthn/register-options-challenge?username=<username>&displayName=<displayName>`: 登録チャレンジをセットアップして取得する

source: `GenerateToken` main driver class
ja_jp: `GenerateToken` メインドライバークラス

source: `GeneratedBeanBuildItem` Example
ja_jp: `GeneratedBeanBuildItem` の例

source: `GitHubProfileService` and `GitHubApiClient` classes remain the same as in the <<vertx-oidc-to-quarkus-oidc>> section.
ja_jp: `GitHubProfileService` クラスと `GitHubApiClient` クラスは <<vertx-oidc-to-quarkus-oidc>> セクションと同じままです。

source: `Greeter` is the service name.
ja_jp: `Greeter` はサービス名です。

source: `GrpcClientUtils` work with all flavors of clients.
ja_jp: `GrpcClientUtils` は、あらゆる種類のクライアントに対応しています。

source: `HS256` is the default symmetric key signature algorithm.
ja_jp: `HS256` はデフォルトの対称鍵署名アルゴリズムです。

source: `HTTP`, `GraphQL`,`Scheduler`, etc., may appear when relevant extensions are in use
ja_jp: 関連するエクステンションが使用されている場合、 `HTTP`、 `GraphQL`、 `Scheduler` などが表示されることがあります。

source: `HealthCheck` is a functional interface whose single method `call` returns a `HealthCheckResponse` object which can be easily constructed by the fluent builder API shown in the example.
ja_jp: `HealthCheck` は関数インターフェースで、その単一のメソッド `call` は `HealthCheckResponse` オブジェクトを返します。このオブジェクトは、例で示した fluent builder API で簡単に構築することができます。

source: `HttpAuthenticationMechanism` is the main entry into Quarkus HTTP Security.
ja_jp: `HttpAuthenticationMechanism` は、Quarkus HTTP Securityのメインエントリーです。

source: `HttpServerStart` example
ja_jp: `HttpServerStart` の例

source: `IdentityProvider` converts the authentication credentials provided by `HttpAuthenticationMechanism` to `SecurityIdentity`.
ja_jp: `IdentityProvider` は、 `HttpAuthenticationMechanism` が提供する認証資格情報を `SecurityIdentity` に変換します。

source: `IdentityProvider` converts the authentication credentials provided by `HttpAuthenticationMechanism` to a `SecurityIdentity` instance.
ja_jp: `IdentityProvider` は、 `HttpAuthenticationMechanism` から提供された認証クレデンシャルを、 `SecurityIdentity` インスタンスに変換します。

source: `IdentityProvider` verifies the authentication credentials and maps them to `SecurityIdentity` which contains the username, roles, the original authentication credentials, and other attributes.
ja_jp: `IdentityProvider` は認証資格情報を検証し、ユーザー名、ロール、元の認証資格情報、およびその他の属性を含む `SecurityIdentity` にマップします。

source: `IdentityProvider` verifies the authentication credentials and maps them to `SecurityIdentity`, which has the username, roles, original authentication credentials, and other attributes.
ja_jp: `IdentityProvider` は、認証クレデンシャルを検証し、ユーザー名、ロール、元の認証クレデンシャル、およびその他の属性を持つ `SecurityIdentity` にマップします。

source: `InjectionPointTransformerBuildItem` Example
ja_jp: `InjectionPointTransformerBuildItem` の例

source: `Instance.Handle.close()` Behavior
ja_jp: `Instance.Handle.close()` の動作

source: `Instant` or `UUID`
ja_jp: `Instant` または `UUID`

source: `InterceptorBindingRegistrarBuildItem` Example
ja_jp: `InterceptorBindingRegistrarBuildItem` の例

source: `InvocationContext#getTarget()` returns `null` for obvious reasons; therefore not all existing interceptors may behave correctly when intercepting static methods
ja_jp: `InvocationContext#getTarget()` は明白な理由により `null` を返します。したがって、静的メソッドを傍受するときに既存のインターセプターがすべて正しく動作するとは限りません。

source: `InvocationContext#getTarget()` returns `null` for obvious reasons; therefore, not all existing interceptors may behave correctly when intercepting static methods
ja_jp: `InvocationContext#getTarget()` は明白な理由により `null` を返します。したがって、静的メソッドをインターセプトする場合、既存のすべてのインターセプターが正しく動作するとは限りません。

source: `Jobs.everySecond()` is skipped until `MyService.isStarted()` returns `true`.
ja_jp: `Jobs.everySecond()` は、 `MyService.isStarted()` が `true` を返すまでスキップされます。

source: `JsonObject` can be used to map an object into its JSON representation and build an object from a JSON document:
ja_jp: `JsonObject` は、オブジェクトをJSON表現にマッピングしたり、JSONドキュメントからオブジェクトを構築するために使用できます。

source: `JsonWebTokenRequestFilter` makes it easy for `Service A` implementations to update the injected `org.eclipse.microprofile.jwt.JsonWebToken` with the new `issuer` and `audience` claim values and secure the updated token again with a new signature. The only difficult step is ensuring that `Service A` has a signing key, which should be provisioned from a secure file system or remote secure storage such as Vault.
ja_jp: `JsonWebTokenRequestFilter` を使用すると、 `Service A` の実装は、注入された `org.eclipse.microprofile.jwt.JsonWebToken` を新しい `issuer` および `audience` のクレーム値で簡単に更新し、更新されたトークンを新しい署名で再保護できます。唯一困難なのは、 `Service A` が署名キーを持っていることを確認することです。署名キーは、セキュアなファイルシステムまたは Vault などのリモートセキュアストレージからプロビジョニングする必要があります。

source: `JsonWebTokenRequestFilter` makes it easy for `Service A` implementations to update the injected `org.eclipse.microprofile.jwt.JsonWebToken` with the new `issuer` and `audience` claim values and secure the updated token again with a new signature. The only difficult step is ensuring that `Service A` has a signing key which should be provisioned from a secure file system or remote secure storage such as Vault.
ja_jp: `JsonWebTokenRequestFilter` により、 `Service A` の実装は注入された `org.eclipse.microprofile.jwt.JsonWebToken` を新しい `issuer` と `audience` のクレーム値で更新し、更新したトークンのセキュリティーは、新しい署名で簡単に確保できます。唯一困難な手順としては、 `Service A` に署名鍵があるかの確認が挙げられます。署名鍵は、安全なファイルシステムか、Vault のようなリモートのセキュアなストレージからプロビジョニングする必要があります。

source: `JsonWebTokenRequestFilter` makes it easy for `Service A` implementations to update the injected `org.eclipse.microprofile.jwt.JsonWebToken` with the new `issuer` and `audience` claim values and secure the updated token again with a new signature. The only difficult step is ensuring that `Service A` has a signing key; it should be provisioned from a secure file system or remote secure storage such as Vault.
ja_jp: `JsonWebTokenRequestFilter` により、 `Service A` の実装は注入された `org.eclipse.microprofile.jwt.JsonWebToken` を新しい `issuer` と `audience` のクレーム値で更新し、更新したトークンのセキュリティーは、新しい署名で簡単に確保できます。唯一困難な手順としては、 `Service A` に署名鍵があるかの確認が挙げられます。署名鍵は、安全なファイルシステムか、Vault のようなリモートのセキュアなストレージからプロビジョニングする必要があります。

source: `JsonWebTokenRequestFilter` makes it easy for `Service A` implementations to update the injected `org.eclipse.microprofile.jwt.JsonWebToken` with the new `issuer` and `audience` claim values and secure the updated token again with a new signature. The only difficult step is to ensure `Service A` has a signing key - it should be provisioned from a secure file system or from the remote secure storage such as Vault.
ja_jp: `JsonWebTokenRequestFilter` は、 `Service A` の実装が、注入された `org.eclipse.microprofile.jwt.JsonWebToken` を新しい `issuer` と `audience` のクレーム値で更新し、更新されたトークンを新しい署名で再度保護することを容易にします。唯一の難しいステップは、 `Service A` に署名鍵を持たせることです。署名鍵は、安全なファイルシステムまたは Vault などのリモートの安全なストレージからプロビジョニングする必要があります。

source: `KEBAB_CASE` (default) - The method name is derived by replacing case changes with a dash to map the configuration property, i.e. `theHost` maps to `the-host`.
ja_jp: `KEBAB_CASE` (デフォルト) - メソッド名は、設定プロパティをマップするために、大文字小文字の変化をダッシュに置き換えて導出されます。つまり、 `theHost` は `the-host` にマップされます。

source: `KEBAB_CASE` (default) - The method name is derived by replacing case changes with a dash to map the configuration property.
ja_jp: `KEBAB_CASE` （デフォルト） - メソッド名は、設定プロパティをマッピングするために、ケースの変更をダッシュに置き換えて導き出されます。

source: `KeycloakTestResourceLifecycleManager` registers `alice` and `admin` users. The user `alice` has the `user` role only by default - it can be customized with a `keycloak.token.user-roles` system property.
ja_jp: `KeycloakTestResourceLifecycleManager` は `alice` と `admin` ユーザーを登録します。 ユーザー `alice` にはデフォルトで `user` ロールのみが付与されており、これは `keycloak.token.user-roles` システムプロパティーでカスタマイズできます。

source: `KeycloakTestResourceLifecycleManager` registers `alice` and `admin` users. The user `alice` has the `user` role only by default - it can be customized with a `keycloak.token.user-roles` system property. The user `admin` has the `user` and `admin` roles by default - it can be customized with a `keycloak.token.admin-roles` system property.
ja_jp: `KeycloakTestResourceLifecycleManager` は `alice` と `admin` ユーザーを登録します。ユーザー `alice` にはデフォルトで `user` ロールしかありませんが、 `keycloak.token.user-roles` システムプロパティーでカスタマイズできます。ユーザー `admin` にはデフォルトで `user` と `admin` ロールがありますが、 `keycloak.token.admin-roles` システムプロパティーでカスタマイズできます。

source: `LoadBalancerProviderConfiguration` which is a configuration for the load balancer
ja_jp: ロードバランサーの設定である `LoadBalancerProviderConfiguration`

source: `LoadBalancerProvider` which creates instances of `LoadBalancer` for a given load balancer _type_
ja_jp: `LoadBalancerProvider` ロードバランサーの _type_ に応じて `LoadBalancer` のインスタンスを作成します。
